In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [10]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.993801 -0.482233
1  X   beta  0.734554  1.554462
2  Y  alpha  0.485345  0.568019
3  Y   beta  0.288171 -1.208805
4  Z  alpha  0.081450 -0.784179

In [11]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [12]:
group1.mean()

k1
X   -0.629624
Y    0.386758
Z    0.081450
Name: dataset1, dtype: float64

In [13]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [14]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.993801 -0.482233
1  X   beta  0.734554  1.554462
2  Y  alpha  0.485345  0.568019
3  Y   beta  0.288171 -1.208805
4  Z  alpha  0.081450 -0.784179

In [15]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.734554
    JAN    0.485345
NY  FEB    0.288171
    JAN   -0.956176
Name: dataset1, dtype: float64

In [16]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.629624  0.536115
Y   0.386758 -0.320393
Z   0.081450 -0.784179

In [17]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.993801 -0.482233
   beta   0.734554  1.554462
Y  alpha  0.485345  0.568019
   beta   0.288171 -1.208805
Z  alpha  0.081450 -0.784179

In [18]:
# 列限定
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

In [19]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.482233
   beta   1.554462
Y  alpha  0.568019
   beta  -1.208805
Z  alpha -0.784179

In [20]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [21]:
for name,group in dframe.groupby('k1'):
    print('this is the {} group'.format(name))
    print(group)
    print('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.993801 -0.482233
1  X   beta  0.734554  1.554462


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.485345  0.568019
3  Y   beta  0.288171 -1.208805


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha   0.08145 -0.784179

In [22]:
gr = dframe.groupby('k1')
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -1.993801 -0.482233
1  X   beta  0.734554  1.554462

In [24]:
# リストを作ってそれを辞書にするこもできます。
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -1.993801 -0.482233
1  X   beta  0.734554  1.554462

In [25]:
# 列方向（axis = 1）についても同じような事ができます。
# ちょっと複雑ですが、
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.993801 -0.482233
 1  0.734554  1.554462
 2  0.485345  0.568019
 3  0.288171 -1.208805
 4  0.081450 -0.784179,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}